programming/c/notes/libraries.org
#+title: libraries
#+options: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

* summary

#+BEGIN_SRC c
  #include <ctype.h>
  #include <math.h>
  #include <stdarg.h>
  #include <stdio.h>
  #include <stdlib.h>
  #include <string.h>


  char *strdup(const char *s);
  man strdup
  man string.h
#+END_SRC

* ctype.h - character types

=#include <ctype.h>=

#+BEGIN_SRC c
  int   isalnum(int);
  int   isalpha(int);

  int   isascii(int);

  int   isblank(int);
  int   iscntrl(int);
  int   isdigit(int);
  int   isgraph(int);
  int   islower(int);
  int   isprint(int);
  int   ispunct(int);
  int   isspace(int);
  int   isupper(int);
  int   isxdigit(int);

  int   toascii(int);

  int   tolower(int);
  int   toupper(int);
#+END_SRC

