programming/c/notes/libraries.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>libraries</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">libraries</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org24d446d">summary</a></li>
<li><a href="#orgec780c0">ctype.h - character types</a></li>
<li><a href="#org450c11e">math.h - mathematical declarations</a></li>
<li><a href="#org72ab748">stdarg.h - handle variable argument list</a></li>
<li><a href="#org67aee41">stdio.h - standard buffered input/output</a></li>
<li><a href="#org6199fab">stdlib.h - standard library definitions</a></li>
<li><a href="#org835fedd">string.h - string operations</a></li>
</ul>
</div>
</div>

<div id="outline-container-org24d446d" class="outline-2">
<h2 id="org24d446d">summary</h2>
<div class="outline-text-2" id="text-org24d446d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;math.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdarg.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>


<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">strdup</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>);
man strdup
<span style="color: #0072b2; font-weight: bold;">man</span> <span style="color: #e69f00; font-weight: bold;">string</span>.h
</pre>
</div>

<pre class="example">
&lt;assert.h&gt;
&lt;ctype.h&gt;
&lt;errno.h&gt;
&lt;float.h&gt;
&lt;limits.h&gt;
&lt;locale.h&gt;
&lt;math.h&gt;
&lt;setjmp.h&gt;
&lt;signal.h&gt;
&lt;stdarg.h&gt;
&lt;stddef.h&gt;
&lt;stdio.h&gt;
&lt;stdlib.h&gt;
&lt;string.h&gt;
&lt;time.h&gt;
</pre>
</div>
</div>

<div id="outline-container-orgec780c0" class="outline-2">
<h2 id="orgec780c0">ctype.h - character types</h2>
<div class="outline-text-2" id="text-orgec780c0">
<p>
<code>#include &lt;ctype.h&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isalnum</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isalpha</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isascii</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isblank</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">iscntrl</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isdigit</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isgraph</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">islower</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isprint</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">ispunct</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isspace</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isupper</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">isxdigit</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">toascii</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">tolower</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>   <span style="color: #d55e00;">toupper</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
</pre>
</div>
</div>
</div>
