programming/c/notes/libraries.html

<div id="outline-container-org450c11e" class="outline-2">
<h2 id="org450c11e">math.h - mathematical declarations</h2>
<div class="outline-text-2" id="text-org450c11e">
<p>
<code>#include &lt;math.h&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">acos</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">acosf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">acosh</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">acoshf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">acoshl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">acosl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">asin</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">asinf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">asinh</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">asinhf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">asinhl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">asinl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">atan</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">atan2</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">atan2f</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">atan2l</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">atanf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">atanh</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">atanhf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">atanhl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">atanl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">cbrt</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">cbrtf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">cbrtl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">ceil</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">ceilf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">ceill</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">copysign</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">copysignf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">copysignl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">cos</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">cosf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">cosh</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">coshf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">coshl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">cosl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">erf</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">erfc</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">erfcf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">erfcl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">erff</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">erfl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">exp</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">exp2</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">exp2f</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">exp2l</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">expf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">expl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">expm1</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">expm1f</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">expm1l</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">fabs</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">fabsf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">fabsl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">fdim</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">fdimf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">fdiml</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">floor</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">floorf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">floorl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">fma</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">fmaf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">fmal</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">fmax</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">fmaxf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">fmaxl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">fmin</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">fminf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">fminl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">fmod</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">fmodf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">fmodl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">frexp</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">frexpf</span>(<span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">value</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">frexpl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">value</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">hypot</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">hypotf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">hypotl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>         <span style="color: #d55e00;">ilogb</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>         <span style="color: #d55e00;">ilogbf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>         <span style="color: #d55e00;">ilogbl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);

<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">j0</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">j1</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">jn</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);

<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">ldexp</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">ldexpf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">ldexpl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">lgamma</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">lgammaf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">lgammal</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>   <span style="color: #d55e00;">llrint</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>   <span style="color: #d55e00;">llrintf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>   <span style="color: #d55e00;">llrintl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>   <span style="color: #d55e00;">llround</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>   <span style="color: #d55e00;">llroundf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>   <span style="color: #d55e00;">llroundl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">log</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">log10</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">log10f</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">log10l</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">log1p</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">log1pf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">log1pl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">log2</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">log2f</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">log2l</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">logb</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">logbf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">logbl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">logf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">logl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>        <span style="color: #d55e00;">lrint</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>        <span style="color: #d55e00;">lrintf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>        <span style="color: #d55e00;">lrintl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>        <span style="color: #d55e00;">lround</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>        <span style="color: #d55e00;">lroundf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>        <span style="color: #d55e00;">lroundl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">modf</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span> *);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">modff</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">modfl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> *);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">nan</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">nanf</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">nanl</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">nearbyint</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">nearbyintf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">nearbyintl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">nextafter</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">nextafterf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">nextafterl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">nexttoward</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">nexttowardf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">nexttowardl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">pow</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">powf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">powl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">remainder</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">remainderf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">remainderl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">remquo</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">remquof</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">remquol</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">rint</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">rintf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">rintl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">round</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">roundf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">roundl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);

<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">scalb</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);

<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">scalbln</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">scalblnf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">long</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">scalblnl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">long</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">scalbn</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">scalbnf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">scalbnl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">sin</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">sinf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">sinh</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">sinhf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">sinhl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">sinl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">sqrt</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">sqrtf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">sqrtl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">tan</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">tanf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">tanh</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">tanhf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">tanhl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">tanl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">tgamma</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">tgammaf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">tgammal</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">trunc</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>       <span style="color: #d55e00;">truncf</span>(<span style="color: #0072b2; font-weight: bold;">float</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">truncl</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>);

<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">y0</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">y1</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span>      <span style="color: #d55e00;">yn</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">double</span>);
</pre>
</div>
</div>
</div>
