programming/c/notes/libraries.org
* stdarg.h - handle variable argument list

=#include <stdarg.h>=

#+BEGIN_SRC c
  void va_start(va_list ap, argN);
  void va_copy(va_list dest, va_list src);
  type va_arg(va_list ap, type);
  void va_end(va_list ap);
#+END_SRC

