programming/c/notes/libraries.html

<div id="outline-container-org72ab748" class="outline-2">
<h2 id="org72ab748">stdarg.h - handle variable argument list</h2>
<div class="outline-text-2" id="text-org72ab748">
<p>
<code>#include &lt;stdarg.h&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">va_start</span>(<span style="color: #0072b2; font-weight: bold;">va_list</span> <span style="color: #e69f00; font-weight: bold;">ap</span>, argN);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">va_copy</span>(<span style="color: #0072b2; font-weight: bold;">va_list</span> <span style="color: #e69f00; font-weight: bold;">dest</span>, <span style="color: #0072b2; font-weight: bold;">va_list</span> <span style="color: #e69f00; font-weight: bold;">src</span>);
<span style="color: #0072b2; font-weight: bold;">type</span> <span style="color: #d55e00;">va_arg</span>(<span style="color: #0072b2; font-weight: bold;">va_list</span> <span style="color: #e69f00; font-weight: bold;">ap</span>, <span style="color: #0072b2; font-weight: bold;">type</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">va_end</span>(<span style="color: #0072b2; font-weight: bold;">va_list</span> <span style="color: #e69f00; font-weight: bold;">ap</span>);
</pre>
</div>
</div>
</div>
