programming/c/notes/libraries.html

<div id="outline-container-org67aee41" class="outline-2">
<h2 id="org67aee41">stdio.h - standard buffered input/output</h2>
<div class="outline-text-2" id="text-org67aee41">
<p>
<code>#include &lt;stdio.h&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span>     <span style="color: #d55e00;">clearerr</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);

<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">ctermid</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fclose</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);

<span style="color: #0072b2; font-weight: bold;">FILE</span>    *<span style="color: #d55e00;">fdopen</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">feof</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">ferror</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fflush</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fgetc</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fgetpos</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">fpos_t</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">fgets</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fileno</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);


<span style="color: #0072b2; font-weight: bold;">void</span>     <span style="color: #d55e00;">flockfile</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);

<span style="color: #0072b2; font-weight: bold;">FILE</span>    *<span style="color: #d55e00;">fopen</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fprintf</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, ...);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fputc</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fputs</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">size_t</span>   <span style="color: #d55e00;">fread</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">FILE</span>    *<span style="color: #d55e00;">freopen</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>,
                   <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fscanf</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, ...);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fseek</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *, <span style="color: #0072b2; font-weight: bold;">long</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fseeko</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *, <span style="color: #0072b2; font-weight: bold;">off_t</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">fsetpos</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">fpos_t</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span>     <span style="color: #d55e00;">ftell</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);

<span style="color: #0072b2; font-weight: bold;">off_t</span>    <span style="color: #d55e00;">ftello</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);


<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">ftrylockfile</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">void</span>     <span style="color: #d55e00;">funlockfile</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);

<span style="color: #0072b2; font-weight: bold;">size_t</span>   <span style="color: #d55e00;">fwrite</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">getc</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">getchar</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">getc_unlocked</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">getchar_unlocked</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">gets</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">pclose</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);

<span style="color: #0072b2; font-weight: bold;">void</span>     <span style="color: #d55e00;">perror</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">FILE</span>    *<span style="color: #d55e00;">popen</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">printf</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, ...);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">putc</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">putchar</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">putc_unlocked</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">putchar_unlocked</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">puts</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">remove</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">rename</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">void</span>     <span style="color: #d55e00;">rewind</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">scanf</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, ...);
<span style="color: #0072b2; font-weight: bold;">void</span>     <span style="color: #d55e00;">setbuf</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">setvbuf</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">snprintf</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, ...);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">sprintf</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, ...);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">sscanf</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span> ...);

<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">tempnam</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">FILE</span>    *<span style="color: #d55e00;">tmpfile</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">tmpnam</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">ungetc</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">vfprintf</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">va_list</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">vfscanf</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">va_list</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">vprintf</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">va_list</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">vscanf</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">va_list</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">vsnprintf</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, size_t, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, va_list;
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">vsprintf</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">va_list</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">vsscanf</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">va_list</span> <span style="color: #e69f00; font-weight: bold;">arg</span>);
</pre>
</div>
</div>
</div>
