programming/c/notes/libraries.html

<div id="outline-container-org6199fab" class="outline-2">
<h2 id="org6199fab">stdlib.h - standard library definitions</h2>
<div class="outline-text-2" id="text-org6199fab">
<p>
<code>#include &lt;stdlib.h&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">_Exit</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">a64l</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">abort</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">abs</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">atexit</span>(<span style="color: #0072b2; font-weight: bold;">void</span> (*)(<span style="color: #0072b2; font-weight: bold;">void</span>));
<span style="color: #0072b2; font-weight: bold;">double</span>        <span style="color: #d55e00;">atof</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">atoi</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">atol</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>     <span style="color: #d55e00;">atoll</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">void</span>         *<span style="color: #d55e00;">bsearch</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>,
                           <span style="color: #0072b2; font-weight: bold;">int</span> (*)(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *));
<span style="color: #0072b2; font-weight: bold;">void</span>         *<span style="color: #d55e00;">calloc</span>(<span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">div_t</span>         <span style="color: #d55e00;">div</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">double</span>        <span style="color: #d55e00;">drand48</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">ecvt</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>); (LEGACY )
<span style="color: #0072b2; font-weight: bold;">double</span>        <span style="color: #d55e00;">erand48</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">short</span>[3]);

<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">exit</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">fcvt</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>); (LEGACY )

<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">free</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *);

<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">gcvt</span>(<span style="color: #0072b2; font-weight: bold;">double</span>, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *); (LEGACY )

<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">getenv</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">getsubopt</span>(<span style="color: #0072b2; font-weight: bold;">char</span> **, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">const</span> *, <span style="color: #0072b2; font-weight: bold;">char</span> **);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">grantpt</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">initstate</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">jrand48</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">short</span>[3]);
<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">l64a</span>(<span style="color: #0072b2; font-weight: bold;">long</span>);

<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">labs</span>(<span style="color: #0072b2; font-weight: bold;">long</span>);

<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">lcong48</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">short</span>[7]);

<span style="color: #0072b2; font-weight: bold;">ldiv_t</span>        <span style="color: #d55e00;">ldiv</span>(<span style="color: #0072b2; font-weight: bold;">long</span>, <span style="color: #0072b2; font-weight: bold;">long</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>     <span style="color: #d55e00;">llabs</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>);
<span style="color: #0072b2; font-weight: bold;">lldiv_t</span>       <span style="color: #d55e00;">lldiv</span>(<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>, <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>);

<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">lrand48</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #0072b2; font-weight: bold;">void</span>         *<span style="color: #d55e00;">malloc</span>(<span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">mblen</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">size_t</span>        <span style="color: #d55e00;">mbstowcs</span>(<span style="color: #0072b2; font-weight: bold;">wchar_t</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">mbtowc</span>(<span style="color: #0072b2; font-weight: bold;">wchar_t</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);

<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">mktemp</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *); (LEGACY )
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">mkstemp</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">mrand48</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">nrand48</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">short</span>[3]);


<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">posix_memalign</span>(<span style="color: #0072b2; font-weight: bold;">void</span> **, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);


<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">posix_openpt</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">ptsname</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">putenv</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">qsort</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>, <span style="color: #0072b2; font-weight: bold;">int</span> (*)(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *,
                           <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *));
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">rand</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">rand_r</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> *);


<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">random</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #0072b2; font-weight: bold;">void</span>         *<span style="color: #d55e00;">realloc</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>);

<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">realpath</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">short</span> <span style="color: #d55e00;">seed48</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">short</span>[3]);


<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">setenv</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>);


<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">setkey</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">char</span>         *<span style="color: #d55e00;">setstate</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">srand</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span>);

<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">srand48</span>(<span style="color: #0072b2; font-weight: bold;">long</span>);
<span style="color: #0072b2; font-weight: bold;">void</span>          <span style="color: #d55e00;">srandom</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span>);

<span style="color: #0072b2; font-weight: bold;">double</span>        <span style="color: #d55e00;">strtod</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> **<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">float</span>         <span style="color: #d55e00;">strtof</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> **<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">long</span>          <span style="color: #d55e00;">strtol</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> **<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">double</span>   <span style="color: #d55e00;">strtold</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> **<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>     <span style="color: #d55e00;">strtoll</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> **<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #d55e00;">strtoul</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> **<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">long</span>
                    <span style="color: #d55e00;">strtoull</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">char</span> **<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">system</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">unlockpt</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);


<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">unsetenv</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">size_t</span>        <span style="color: #d55e00;">wcstombs</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">wchar_t</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>           <span style="color: #d55e00;">wctomb</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">wchar_t</span>);
</pre>
</div>
</div>
</div>
