programming/c/notes/libraries.html

<div id="outline-container-org835fedd" class="outline-2">
<h2 id="org835fedd">string.h - string operations</h2>
<div class="outline-text-2" id="text-org835fedd">
<p>
<code>#include &lt;string.h&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span>    *<span style="color: #d55e00;">memccpy</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);

<span style="color: #0072b2; font-weight: bold;">void</span>    *<span style="color: #d55e00;">memchr</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">memcmp</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">void</span>    *<span style="color: #d55e00;">memcpy</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">void</span>    *<span style="color: #d55e00;">memmove</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">void</span>    *<span style="color: #d55e00;">memset</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strcat</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strchr</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">strcmp</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">strcoll</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strcpy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);
<span style="color: #0072b2; font-weight: bold;">size_t</span>   <span style="color: #d55e00;">strcspn</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strdup</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strerror</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #0072b2; font-weight: bold;">int</span>     *<span style="color: #d55e00;">strerror_r</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>);

<span style="color: #0072b2; font-weight: bold;">size_t</span>   <span style="color: #d55e00;">strlen</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strncat</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">int</span>      <span style="color: #d55e00;">strncmp</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strncpy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strpbrk</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strrchr</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">size_t</span>   <span style="color: #d55e00;">strspn</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strstr</span>(<span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strtok</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>);

<span style="color: #0072b2; font-weight: bold;">char</span>    *<span style="color: #d55e00;">strtok_r</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">char</span> **);

<span style="color: #0072b2; font-weight: bold;">size_t</span>   <span style="color: #d55e00;">strxfrm</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #56b4e9; font-weight: bold;">restrict</span>, <span style="color: #0072b2; font-weight: bold;">size_t</span>);

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
